In [3]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import OneHotEncoder

import warnings
warnings.filterwarnings('ignore')

In [2]:
dados = {'Country': ['India', 'US', 'Japan', 'US', 'Japan'],
        'Age' : [44, 34, 46, 35, 23],
        'Salary' : [ 72000, 65000, 98000, 45000, 34000]}

df = pd.DataFrame(dados) 
df

  Country  Age  Salary
0   India   44   72000
1      US   34   65000
2   Japan   46   98000
3      US   35   45000
4   Japan   23   34000

In [5]:
df_onehot = df.select_dtypes(include='object')

In [6]:
df_onehot

  Country
0   India
1      US
2   Japan
3      US
4   Japan

In [9]:
onehotencoder = OneHotEncoder()

In [13]:
x = onehotencoder.fit_transform(df.Country.values.reshape(-1,1)).toarray()

dfOneHot = pd.DataFrame(x, columns = ['Country_'+str(int(i)) for i in range(df.shape[1])])

In [14]:
dfOneHot

   Country_0  Country_1  Country_2
0        1.0        0.0        0.0
1        0.0        0.0        1.0
2        0.0        1.0        0.0
3        0.0        0.0        1.0
4        0.0        1.0        0.0

In [16]:
df = pd.concat([df, dfOneHot], axis=1)

df = df.drop(['Country'], axis = 1)

In [17]:
df

   Age  Salary  Country_0  Country_1  Country_2
0   44   72000        1.0        0.0        0.0
1   34   65000        0.0        0.0        1.0
2   46   98000        0.0        1.0        0.0
3   35   45000        0.0        0.0        1.0
4   23   34000        0.0        1.0        0.0